server/app/controllers/v1/auctions_controller.rb

INSERT INTO "auctions" ("title", "details", "end_date", "reserve_price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    auction = Auction.new auction_params
    auction.user = current_user

    auction.save!

SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."end_date" ASC
---
  def index
    auction = Auction.order(end_date: :ASC)

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 47], ["LIMIT", 1]]
---
  def find_auction
    @auction = Auction.find params[:id]