server/app/controllers/v1/bids_controller.rb

  def create
    bid_params = params.require(:bid).permit(:bid_price)
    bid = Bid.new bid_params
    bid.user = current_user
    bid.auction = Auction.find params[:auction_id]

    bid.save
---
SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = $1 LIMIT $2  [["id", 47], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "bids".* FROM "bids" WHERE "bids"."auction_id" = $1  [["auction_id", 36]]
INSERT INTO "bids" ("bid_price", "auction_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["bid_price", "40"], ["auction_id", 47], ["user_id", 6], ["created_at", "2018-03-26 18:56:38.325107"], ["updated_at", "2018-03-26 18:56:38.325107"]]